## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

  # kubernetes_secret.zerossl-eab-hmac-key must be replaced
-/+ resource "kubernetes_secret" "zerossl-eab-hmac-key" {
!       id                             = "kube-system/zerossl-eab-hmac-key" -> (known after apply)
-       immutable                      = false -> null
        # (3 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 0 -> (known after apply)
-           labels           = {} -> null
            name             = "zerossl-eab-hmac-key"
!           namespace        = "kube-system" -> "cert-manager" # forces replacement
!           resource_version = "1150118" -> (known after apply)
!           uid              = "3916712e-9a43-47e2-8556-2185fac589fc" -> (known after apply)
        }
    }

  # kubernetes_secret.zerossl-eab-hmac-key-id must be replaced
-/+ resource "kubernetes_secret" "zerossl-eab-hmac-key-id" {
!       id                             = "kube-system/zerossl-eab-hmac-key-id" -> (known after apply)
-       immutable                      = false -> null
        # (3 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 0 -> (known after apply)
-           labels           = {} -> null
            name             = "zerossl-eab-hmac-key-id"
!           namespace        = "kube-system" -> "cert-manager" # forces replacement
!           resource_version = "1150117" -> (known after apply)
!           uid              = "25dd339c-8412-4f6a-82d5-a33ca142874d" -> (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 248.11 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 248.11 | 248.11|
| | **Total** | **0.00** | **248.11** | **248.11** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
